In [1]:
import pandas as pd

The history saving thread hit an unexpected error (DatabaseError('database disk image is malformed')).History will not be written to the database.

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [2]:
titles = pd.read_csv('data/titles.csv', index_col=None)
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [3]:
cast = pd.read_csv('data/cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Define a year as a "Superman year" whose films feature more Superman characters than Batman. How many years in film history have been Superman years?

In [35]:
filter_movies = (cast['character'] =='Superman') | (cast['character'] == 'Batman')

In [36]:
super_df = cast[filter_movies][['year','character']].groupby(['year','character']).size()

In [37]:
super_df = super_df.unstack()
super_df = super_df.fillna(0)

In [39]:
super_df.head()

character  Batman  Superman
year
1938          1.0       0.0
1940          1.0       0.0
1943          1.0       0.0
1948          0.0       1.0
1949          2.0       0.0

In [41]:
counts = super_df.Superman - super_df.Batman
print(f'Superman years: {len(counts[counts > 0.0])}')

Superman years: 11

### How many years have been "Batman years", with more Batman characters than Superman characters?

In [42]:
print(f'Batman years: {len(counts[counts < 0.0])}')

Batman years: 26

### Count the number of actor roles each year and the number of actress roles each year over the history of film.

In [52]:
roles = cast.groupby(['year','type']).size()
roles = roles.unstack('type')
roles = roles.fillna(0)
roles

type  actor  actress
year
1894    2.0      1.0
1900    2.0      0.0
1905    1.0      0.0
1906   14.0      3.0
1907    5.0      0.0
...     ...      ...
2021    9.0      4.0
2022   18.0     11.0
2023    6.0      5.0
2025    2.0      0.0
2026    1.0      0.0

[123 rows x 2 columns]

### Find the difference between the number of actor roles each year and the number of actress roles each year over the history of film.

In [53]:
roles = cast.groupby(['year','type']).size()
roles = roles.unstack('type')
roles = roles.fillna(0)
difference = (roles.actor - roles.actress)
difference

year
1894     1.0
1900     2.0
1905     1.0
1906    11.0
1907     5.0
        ...
2021     5.0
2022     7.0
2023     1.0
2025     2.0
2026     1.0
Length: 123, dtype: float64

### What is the fraction of roles that have been 'actor' roles each year in the history of film.

In [55]:
roles = cast.groupby(['year','type']).size()
roles = roles.unstack('type')
roles = roles.fillna(0)
fraction = roles.actor / (roles.actor + roles.actress)
fraction

year
1894    0.666667
1900    1.000000
1905    1.000000
1906    0.823529
1907    1.000000
          ...
2021    0.692308
2022    0.620690
2023    0.545455
2025    1.000000
2026    1.000000
Length: 123, dtype: float64

### What is the fraction of supporting (n=2) roles that have been 'actor' roles each year in the history of film.

In [61]:
filter_n = cast['n'] == 2
roles = cast[filter_n].groupby(['year','type']).size()
roles = roles.unstack('type')
roles = roles.fillna(0)
fraction = roles.actor / (roles.actor + roles.actress)
fraction

year
1906    0.666667
1907    1.000000
1908    1.000000
1910    0.500000
1911    0.736842
          ...
2016    0.561779
2017    0.578637
2018    0.577465
2019    0.777778
2020    0.333333
Length: 114, dtype: float64